contingent/application/contingent-area/src/test/resources/xml/addAreaAddress2549.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:user="http://emias.mos.ru/system/v1/userContext/" xmlns:typ="http://emias.mos.ru/contingent2/area/v3/types/" xmlns:v3="http://emias.mos.ru/contingent2/address/v3/" xmlns:v31="http://emias.mos.ru/contingent2/core/v3/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-3">
                <wsse:Username>autotest</wsse:Username>
            </wsse:UsernameToken>
        </wsse:Security>
        <user:userContext>
            <user:systemName>UPK/UPK</user:systemName>
            <user:userName>autotest</user:userName>
            <user:userRoleId>10</user:userRoleId>
            <!--Optional:-->
            <user:isUserRoleSystemWide>false</user:isUserRoleSystemWide>
            <user:userRights>
                <!--Zero or more repetitions:-->
                <user:userRightId>320013</user:userRightId>
            </user:userRights>
            <user:jobExecutionId>100</user:jobExecutionId>
            <!--Optional:-->
            <user:hostIp>192.168.0.0</user:hostIp>
            <!--Optional:-->
            <user:hostName>serv_test</user:hostName>
        </user:userContext>
    </soap:Header>
    <soap:Body>
        <typ:addAreaAddressRequest>
            <typ:areaId>17411938341</typ:areaId>
            <!--1 or more repetitions:-->
            <typ:address globalIdNsi="-999999997" aoLevel="7">
                <v3:addressString>город Москва, Улица Рандомная</v3:addressString>
                <v3:region id="1111">
                    <v3:name>Москва</v3:name>
                </v3:region>
                <!--Optional:-->
                <v3:regionOMKTE id="1111" code="1111">
                    <v3:name>Регион ОМКТЕ</v3:name>
                </v3:regionOMKTE>
                <!--Optional:-->
                <v3:area id="1111" code="111">
                    <v3:name>Сведения о районе в регионе ОМКТЕ</v3:name>
                    <!--Optional:-->
                    <v3:type>
                        <v3:full>Описание типа полностью</v3:full>
                        <!--Optional:-->
                        <v3:short>Тип коротко</v3:short>
                    </v3:type>
                    <!--Optional:-->
                    <v3:codeOMKTE>1111</v3:codeOMKTE>
                    <!--Optional:-->
                    <v3:codeBTI>1111</v3:codeBTI>
                </v3:area>
                <!--Optional:-->
                <v3:areaOMKTE id="2222" code="2222">
                    <v3:name>Район ОМКТЕ</v3:name>
                    <!--Optional:-->
                    <v3:type>
                        <v3:full>Фулл район</v3:full>
                        <!--Optional:-->
                        <v3:short>Шорт район</v3:short>
                    </v3:type>
                </v3:areaOMKTE>
                <v3:city id="333" code="333">
                    <v3:name>Сити</v3:name>
                    <!--Optional:-->
                    <v3:type>
                        <v3:full>Сити Фул</v3:full>
                        <!--Optional:-->
                        <v3:short>Сити шорт</v3:short>
                    </v3:type>
                    <!--Optional:-->
                    <v3:codeOMKTM>333</v3:codeOMKTM>
                    <!--Optional:-->
                    <v3:codeBTI>333</v3:codeBTI>
                </v3:city>
                <v3:place id="444" code="444">
                    <v3:name>Плэйс</v3:name>
                    <!--Optional:-->
                    <v3:type>
                        <v3:full>Плейс Фул</v3:full>
                        <!--Optional:-->
                        <v3:short>Плейс шорт</v3:short>
                    </v3:type>
                    <!--Optional:-->
                    <v3:codeOMKTM>444</v3:codeOMKTM>
                    <!--Optional:-->
                    <v3:codeBTI>444</v3:codeBTI>
                </v3:place>
                <v3:plan id="5555" code="5555">
                    <v3:name>План</v3:name>
                    <!--Optional:-->
                    <v3:type>
                        <v3:full>План фул</v3:full>
                        <!--Optional:-->
                        <v3:short>План шорт</v3:short>
                    </v3:type>
                    <!--Optional:-->
                    <v3:codeBTI>444</v3:codeBTI>
                </v3:plan>
                <v3:street id="5555" code="5555">
                    <v3:name>Рандомная улица</v3:name>
                    <!--Optional:-->
                    <v3:type>
                        <v3:full>Улица</v3:full>
                        <!--Optional:-->
                        <v3:short>ул</v3:short>
                    </v3:type>
                    <!--Optional:-->
                    <v3:codeOMKUM>55555</v3:codeOMKUM>
                    <!--Optional:-->
                    <v3:codeBTI>55555</v3:codeBTI>
                </v3:street>
            </typ:address>
        </typ:addAreaAddressRequest>
    </soap:Body>
</soap:Envelope>